---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Infrastructure.HorizontalCurveEndpoint
source: html/1d150bb8-32d5-56f6-e3a1-dd58b3f5d534.htm
---
# HorizontalCurveEndpoint Members

The HorizontalCurveType
 of the curve which connects the endpoint to the next displayed curve.
 If this endpoint's Station equals
 DisplayedEndStation , returns Unknown curve type.